app/views/orders/_form.html.erb

	<div class="col-md-7">
		<%= f.collection_select :shipping_area_id, ShippingArea.all, :id, :name_with_cost, {:allow_blank => false, prompt: 'Selecciona la zona de despacho' }, style: "width:100%", class: 'form-control input-sm' %>
---
SELECT `shipping_areas`.* FROM `shipping_areas`