app/views/orders/_product_order_fields.html.erb

SELECT `products`.* FROM `products`
---
	<div class="col-md-6">
		<%= po.collection_select :product_id, Product.all, :id, :name_with_price, {:allow_blank => false, prompt: 'Selecciona el producto' } , style: "width:100%", class: 'form-control input-sm' %>