app/views/orders/index.html.erb

SELECT SUM(`product_orders`.`product_price`) AS sum_id FROM `product_orders` WHERE `product_orders`.`order_id` = 3
SELECT `orders`.* FROM `orders`
---
			        <td><%= order.created_at %></td>
					<td><%= number_to_currency order.product_orders.sum(:product_price) + order.shipping_cost, precision: 0 %></td>