app/views/orders/show.html.erb

			  </div>
				<% @order.product_orders.each do |po| %>
---
SELECT `product_orders`.* FROM `product_orders` WHERE `product_orders`.`order_id` = 2

					<div class="col-md-6" style="text-align:left;">
				  		 <%= number_to_currency @order.product_orders.sum(:product_price), precision: 0 %>
---
SELECT SUM(`product_orders`.`product_price`) AS sum_id FROM `product_orders` WHERE `product_orders`.`order_id` = 2