app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO `contacts` (`content`, `created_at`, `email`, `name`, `phone_number`, `updated_at`) VALUES ('sasdasdas', '2014-08-13 02:15:47', '7778888', 'Hans Hanckes', '56992513658', '2014-08-13 02:15:47')