app/controllers/orders_controller.rb

INSERT INTO `orders` (`address`, `created_at`, `name`, `phone_number`, `shipping_area_id`, `shipping_cost`, `updated_at`) VALUES (0, '2014-08-13 02:05:11', 'Hans Hanckes', '56992513658', 1, 4000, '2014-08-13 02:05:11')
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save

DELETE FROM `orders` WHERE `orders`.`id` = 2
---
  def destroy
    @order.destroy